<template>
  <el-timeline>
    <el-timeline-item
      center
      placement="top"
      v-for="(item, index) in activities"
      :key="index"
      timestamp="项目名/"
    >
      <el-card>
        <h4>
          <span>学校/工作</span>
          <span>职务/岗位</span>
          <span>项目/？？</span>
        </h4>
        <p>{{ item.content }}</p>
      </el-card>
    </el-timeline-item>
  </el-timeline>
</template>

<script setup lang="ts">
const activities = [
  {
    title: "活动按期",
    timestamp: "2018-04-15",
    content:
      "开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始",
  },
  {
    title: "活动按期",
    timestamp: "2018-04-15",
    content:
      "开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始",
  },
  {
    title: "活动按期",
    timestamp: "2018-04-15",
    content:
      "开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始",
  },
  {
    title: "活动按期",
    timestamp: "2018-04-15",
    content:
      "开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始",
  },
  {
    title: "活动按期",
    timestamp: "2018-04-15",
    content:
      "开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始活动按期开始",
  },
];
</script>

<style scoped lang="scss">
h4 {
  display: flex;
  justify-content: space-around;
  margin-bottom: 5px;
}
</style>
